Catalogs/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Автомобили</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГосЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаРасходаТопливаЛето</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаРасходаТопливаЗима</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосЗнакПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецТранспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Автомобили/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СобственныйПриИзменении(Элемент)
	Если Объект.Собственный Тогда
		Элементы.Водитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		Элементы.ВладелецТранспорта.Доступность = Ложь;
		Элементы.ВладелецТранспорта.Видимость = Ложь;
		Элементы.НормаРасходаТопливаЛето.Доступность = Истина;
		Элементы.НормаРасходаТопливаЗима.Доступность = Истина;
		Элементы.НормаРасходаТопливаЛето.Видимость = Истина;
		Элементы.НормаРасходаТопливаЗима.Видимость = Истина;
	Иначе 
		Элементы.Водитель.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Элементы.ВладелецТранспорта.Доступность = Истина;
		Элементы.ВладелецТранспорта.Видимость = Истина;
		Элементы.НормаРасходаТопливаЛето.Доступность = Ложь;
		Элементы.НормаРасходаТопливаЗима.Доступность = Ложь;
		Элементы.НормаРасходаТопливаЛето.Видимость = Ложь;
		Элементы.НормаРасходаТопливаЗима.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрицепПриИзменении(Элемент)
	Если Объект.Прицеп Тогда
		Элементы.МаркаПрицепа.Доступность = Истина;
		Элементы.МаркаПрицепа.Видимость = Истина;
		Элементы.ГосЗнакПрицепа.Доступность = Истина;
		Элементы.ГосЗнакПрицепа.Видимость = Истина;
	Иначе 
		Элементы.МаркаПрицепа.Доступность = Ложь;
		Элементы.МаркаПрицепа.Видимость = Ложь;
		Элементы.ГосЗнакПрицепа.Доступность = Ложь;
		Элементы.ГосЗнакПрицепа.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Собственный Тогда
		Элементы.Водитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		Элементы.ВладелецТранспорта.Доступность = Ложь;
		Элементы.ВладелецТранспорта.Видимость = Ложь;
		Элементы.НормаРасходаТопливаЛето.Доступность = Истина;
		Элементы.НормаРасходаТопливаЗима.Доступность = Истина;
		Элементы.НормаРасходаТопливаЛето.Видимость = Истина;
		Элементы.НормаРасходаТопливаЗима.Видимость = Истина;
	Иначе 
		Элементы.Водитель.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Элементы.ВладелецТранспорта.Доступность = Истина;
		Элементы.ВладелецТранспорта.Видимость = Истина;
		Элементы.НормаРасходаТопливаЛето.Доступность = Ложь;
		Элементы.НормаРасходаТопливаЗима.Доступность = Ложь;
		Элементы.НормаРасходаТопливаЛето.Видимость = Ложь;
		Элементы.НормаРасходаТопливаЗима.Видимость = Ложь;
	КонецЕсли;
	Если Объект.Прицеп Тогда
		Элементы.МаркаПрицепа.Доступность = Истина;
		Элементы.МаркаПрицепа.Видимость = Истина;
		Элементы.ГосЗнакПрицепа.Доступность = Истина;
		Элементы.ГосЗнакПрицепа.Видимость = Истина;
	Иначе 
		Элементы.МаркаПрицепа.Доступность = Ложь;
		Элементы.МаркаПрицепа.Видимость = Ложь;
		Элементы.ГосЗнакПрицепа.Доступность = Ложь;
		Элементы.ГосЗнакПрицепа.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
